#include "gauss.hpp"

//============================================================================================================
//Решение СЛАУ с нижнетреугольной матрицей в разреженном строчном формате.
//============================================================================================================
void Gauss::solveLowSLAE(int dimension, int *ig, int *jg, double *ggl, double *di, double *f)
{
    for(int i = 0; i < dimension; i++)
    {
        for(int j = ig[i]; j < ig[i + 1]; j++)
            f[i] -= ggl[j]*f[jg[j]];
        f[i] /= di[i];
    }
}

//============================================================================================================
//Решение СЛАУ с верхнетреугольной матрицей в разреженном строчном формате (на диагонали единицы).
//============================================================================================================
void Gauss::solveUpSLAE(int dimension, int *ig, int *jg, double *ggu, double *f)
{
    for(int i = dimension - 1; i > 0; i--)
        for(int j = ig[i + 1] - 1; j >= ig[i]; j--)
            f[jg[j]] -= ggu[j]*f[i];
}
